{
    "chess": "Шахматы",
    "ru": "Русский",
    "en": "Английский",
    "title": "Развивайка",
    "home": "Главная",
    "images": "Картинки",
    "colors": "Цвета",
    "ccb": "Выбери Фон Карточек",
    "games": "Игры",
    "rules": "Правила",
    "score": "Рекорды",
    "login": "Войти",
    "dob": "Сложность бота",
    "draw": "Ничья",
    "shipplacement": "Перетяни корабль на поле и нажми на него, чтобы повернуть",
    "logout": "Выйти",
    "auth": "Войти",
    "auth": "Войти",
    "email": "Почта",
    "authpage": "Авторизация",
    "regpage": "Регистрация",
    "opponent": "Поле Противника",
    "your": "Твое Поле",
    "sbg": "Цель игры — потопить корабли противника раньше, чем он успеет потопить ваши.",
    "sbrm": "Когда корабли расставлены, игроки по очереди производят \"выстрелы\", если клетка занята кораблём или его частью эта клетка зачёркивается крестиком и можно сделаеть ещё один выстрел. Если в названной клетке корабля нет, в клетке ставится точка и ход переходит к сопернику.",
    "sbrsp": "Далее, начинается расстановка флотов. Классические правила морского боя говорят, что должно быть 4 корабля по одной клеточке (\"однопалубных\" или \"однотрубных\"), 3 корабля по 2 клеточки, 2 — по 3 клеточки и один — четырёхпалубный. Все корабли должны быть прямыми, не допускается изогнутых и \"диагональных\". Корабли располагаются на игровом поле таким образом, чтобы между ними всегда был зазор в одну клеточку, то есть они не должны касаться друг друга ни бортами, ни углами. При этом корабли могут касаться краёв поля и занимать углы.",
    "sbr": "Играют двое игроков. Каждому из них нужен листок (желательно в клетку), карандаш или ручка. Игра начинается с подготовки поля. На листке рисуются два квадрата 10×10 клеток. На одном из них будут расставляться свои корабли, в другом будет \"вестись огонь\" по кораблям противника. Стороны квадратов подписываются буквами по горизонтали и цифрами по вертикали.",
    "randomise": "Сгенерировать",
    "tttr": "Крестики-нолики - логическая игра между двумя противниками на квадратном поле 3 на 3 клетки или большего размера (вплоть до \"бесконечного поля\"). Один из игроков играет \"крестиками\", второй - \"ноликами\". В традиционной китайской игре используются черные и белые камни. Игроки по очереди ставят на свободные клетки поля 3х3 знаки (один всегда крестики, другой всегда нолики). Первый, выстроивший в ряд 3 своих фигур по вертикали, горизонтали или диагонали, выигрывает. Первый ход делает игрок, ставящий крестики. Обычно по завершении партии выигравшая сторона зачёркивает чертой свои три знака (нолика или крестика), составляющих сплошной ряд. Классические \"крестики-нолики\" на поле 3x3 не представляют никакого практического интереса (разве что для маленьких детей, как начальный этап обучения логическим играм, или в качестве несложного задания по программированию для студенческой лабораторной работы) — общеизвестен алгоритм, который при правильной игре гарантирует ничью любой стороне, а при ошибке противника позволяет выиграть. Таким образом, игра находится в состоянии \"ничейной смерти\".",
    "tr": "Классическое игровое поле пятнашек представляет собой матрицу 4х4 клеток, на котором по порядку (слева - направо и сверху - вниз) располагаются цифры от 1 до 15. Последняя клетка – пустая. Клетки перемешиваются определенным образом, и задача игрока состоит в том, чтобы восстановить их первоначальное правильное расположение. Делать это можно лишь путем перемещения на пустую клетку другой, соседней с ней клетки (расположенной слева, справа, сверху или снизу от пустой).",
    "fpr": "Главной задачей этой игры является - открыть два одинаковых цвета на разных карточках. Максимум можно открыть две карточки. Для того чтобы победить максимлально быстро необходимо запоминать где находится тот или иной цвет.",
    "chessfield": "Перед игрой доска располагается так, чтобы в правом нижнем углу перед каждым из игроков находилось белое поле.Шахматные фигуры расставляются всегда одинаковым образом. Второй ряд (или горизонталь) занимают пешки. Ладьи стоят по углам, рядом с ними - кони, после коней - слоны, наконец, ферзь ставится на поле своего цвета (белый ферзь на белое, чёрный на чёрное), и король занимает оставшееся поле.",
    "chessknight": "Кони ходят иначе, чем другие фигуры - на два поля в одном направлении и далее на одно поле под углом 90 градусов, буквой \"Г\". Конь - единственная фигура, способная перепрыгивать через другие фигуры.",
    "chesspawn": "Пешка - необычная фигура, она ходит и берёт по-разному: ходить пешка может лишь вперёд, а брать - лишь по диагонали. Пешка может передвигаться только на одно поле за ход. но еще не ходившая пешка может пойти вперёд на одно или два поля. Пешка может брать только по диагонали на одно поле перед собой. Пешка не может ходить или брать назад. Если другая фигура находится прямо перед пешкой, та не может сделать ход вперёд и не может взять эту фигуру.",
    "chessqueen": "Ферзь - самая сильная фигура. Он может ходить по прямой в любом направлении - вперёд, назад, в стороны или по диагонали на любое число полей, но при этом он не может перепрыгивать через другие фигуры. Если ферзь или любая другая фигура берёт фигуру соперника, ход заканчивается.",
    "chessrook": "Ладья может ходить на любое число полей, но только вперёд, назад и в стороны (не по диагонали). Ладьи особенно сильны, когда они защищают друг друга и действуют сообща!",
    "chessbishop": "Слон может ходить на любое число полей, соединенных углами по диагонали. Каждому слону доступна только половина полей доски (одного цвета, белого или черного). Слоны хорошо действуют сообща, идеально дополняя друг друга.",
    "chessking": "Король - самая важная фигура, но при этом и одна из самых слабых. Король может ходить только на одно поле в любом направлении: вверх, вниз, в стороны и по диагонали. Король никогда не может вставать на битое поле (где его может взять фигура соперника). Когда король атакован другой фигурой, это называется \"шах\".",
    "password": "Пароль",
    "resetboard": "Сбросить",
    "signup": "Зарегистрироваться",
    "dha": "Нет аккаунта? Создай сейчас!",
    "flipcard": "Найди Пару",
    "puzzle": "Пятнашки",
    "tictactoe": "Крестики-Нолики",
    "subtitle": "Фантазия и Воображение",
    "chessside": "Выбери Свой Цвет",
    "chessBlack": "Черный",
    "chessWhite": "Белый",
    "chesswon": "Победил!",
    "playagain": "Сыграть Снова",
    "backtogames": "Вернуться К Играм",
    "chooseyourdifficulty": "Выбери Сложность",
    "easy": "Легко",
    "medium": "Средне",
    "hard": "Сложно",
    "nickname": "Имя",
    "gameTitle": "Название игры",
    "pts": "Очки",
    "startnewgame": "Начать Игру",
    "reset": "Начать Заново",
    "graduationproject": "Дипломный Проект. Разработчик Алексей Волосевич Группа 44ТП Минский Государственный Колледж Цифровых Технологий, 2023",
    "p404": "Ошибка 404",
    "e404": "Ошибка 404 - Страница Не Найдена",
    "uwon": "Поздравляю! Ты Победил!",
    "ulose": "Ты Прогирал. Не Расстраивайся.",
    "chessdesc": "Шахматы - это игра между двумя соперниками на противоположных сторонах доски, расчерченной на 64 клетки светлого и тёмного цвета. У каждого игрока по 16 фигур: 1 король, 1 ферзь, 2 ладьи, 2 слона, 2 коня и 8 пешек. ",
    "chessgoal": "Цель игры - поставить мат королю соперника. Мат королю это момент, когда он находится под боем фигуры соперника (или говорят под шахом), и невозможно закрыться от шаха, отступить или взять атакующую фигуру.",
    "seabattle": "Морской Бой"

}